/*============================Program Description====================================
程序名称：利用指针数组输出单位矩阵.cpp
程序目的：单位矩阵是主对角线为1，其余为0的矩阵，输出矩阵
Written By Dong-Hong-Yan(2012-4-18)
=====================================================================================*/

#include<iostream>
using namespace std;

//【主函数】
int main()  {
    int line1[] = {1, 0, 0};    //定义数组，矩阵的第一行
    int line2[] = {0, 1, 0};    //定义数组，矩阵的第二行
    int line3[] = {0, 0, 1};    //定义数组，矩阵的第三行

    //定义整型指针数组并初始化
    int *pLine[3] = {line1, line2, line3};

    cout << "Matrix test: " << endl;       //输出单位矩阵
    for(int i = 0; i < 3; i++)  {          //对指针数组元素循环
        for(int j = 0; j < 3; j++)         //对矩阵每一层循环
            cout << pLine[i][j] << " ";
        cout << endl;
    }
    return 0;
}
/*1、上例中，这里的pLine[i][j]是行指针，pLine[i][j]和*(pLine[i] + [j])等价即先
     把指针数组pLine所存储的i个指针读出，然后指向地址后方第j个数
  2、定义指针数组，则在内存中的存储空间不连续，不能用但个指针访问。而二维数组
     中元素存储空间连续，可以用一个指针访问。*/
