/*=============================Program Description==============================
程序名称：数组名做函数参数.cpp
程序目的：在主函数中初始化一个矩阵，将每一个元素输出，调用子函数，计算每一行元素
          和，将和存放每行第一个元素中，返回主函数，输出各行元素之和
Written By Dong-Hong-Yan(2012-4-18)
================================================================================*/

#include<iostream>
using namespace std;

//定义行元素和函数
void rowSum(int a[][4], int nRow)  {     //一般函数调用数组做形参，应该有两个 ，
    for(int i = 0; i < nRow; i++)  {     //一个是数组名，一个是数组一维行参数
        for(int j = 1; j < 4; j++)
            a[i][0] += a[i][j];
    }
}

//【主函数】
int main()  {
    int table[3][4] = {{1, 2, 3, 4}, {2, 3, 4, 5}, {3, 4, 5, 6}};
    for(int i = 0; i < 3; i++)  {
        for(int j = 0; j < 4; j++)
        cout << table[i][j] << " ";
        cout << endl;
    }
    rowSum(table, 3);
    for(int i = 0; i < 3; i++)
    cout << "Sum of row " << i << " is " << table[i][0] << endl;
    return 0;
}
/*【心得】
1、就是说在子函数中，对形参元素的操作结果会影响函数实参的相应元素
2、把数组作为参数时，一般不指定第一维的大小，即使指定，也会被忽略*/
