/*==========================Program Description====================================
程序名称：友元函数及友元类.cpp
程序目的：h函数是X的友元函数，类Z是类X的友元类，类Y中g函数是X的友元函数，f函数是Z的
          成员函数。函数h、g、f分别执行对类X的私有成员i的简单操作！
Written By Dong-Hong-Yan(2012-4-24)
===================================================================================*/
#include"aa.h"                //调用用户自定义头文件aa.h
#include<iostream>
using namespace std;

//【主程序】
int main()  {

	X x(5);   //定义并初始化
	Y y;
	Z z;                     //引用类的成员函数，必须通过类的对象进行调用

	cout << " h函数结果= " << h(x) << endl;
	cout << " g函数结果= " << y.g(x) << endl;    //y.g(x),其中X类对象x作实参
	cout << " f函数结果= " << z.f(x) << endl;

	return 0;
}
